*** Settings ***
Library    SeleniumLibrary
Resource    Resource/shopping-cart-keywords.robot
Test Setup    เปิดให้ดู Step ละ (วินาที)
Test Teardown    ปิดหน้าเบราเซอร์

*** Test Cases ***
ผู้ใช้สามารถค้นหาสินค้าได้สำเร็จ
    [Tags]    Success Case    Search Feature
    เข้าหน้าแสดงรายการสินค้า พบรายการสินค้าทั้งหมด
    ค้าหาสินค้า ช่วงอายุ 3 ถึง 5 ปี และเพศหญิง
    เลือกสินค้า 43 Piece dinner Set
    แสดงรายละเอียดสินค้า 43 Piece dinner Set
    เพิ่มจำนวนสินค้าที่ต้องการจะซื้อเป็น 2 ชิ้น
    เพิ่มสินค้าเข้าตะกร้า
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมเท่ากับ    25.90
    กดยืนยันการสั่งซื้อสินค้า
    แสดงที่อยู่ในการจัดส่ง
    ยืนยันที่อยู่ในการจัดส่ง
    แสดงผลการสั่งซื้อ
